---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.Dispose
source: html/e8ddacd6-aa4c-3784-d61e-8fff7dbfea0f.htm
---
# Autodesk.Revit.DB.FillPattern.Dispose Method

Releases all resources used by the FillPattern

## Syntax (C#)
```csharp
public void Dispose()
```